devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
static CAN_t *CAN_HDL[_CAN_COUNT];

static const CAN_CFG_t CANX[] = {
        #if defined(RCC_APB1ENR_CAN1EN)
        {
                .CAN             = CAN1,
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_CANEN    = RCC_APB1ENR_CAN1EN,
                .APBRSTR_CANRSTR = RCC_APB1RSTR_CAN1RST,
                .TX_IRQn         = CAN1_TX_IRQn,
                .RX0_IRQn        = CAN1_RX0_IRQn,
                .RX1_IRQn        = CAN1_RX1_IRQn,
                .SCE_IRQn        = CAN1_SCE_IRQn,
                .FILTERS_COUNT   = 14,
        },
        #endif
        #if defined(RCC_APB1ENR_CAN2EN)
        {
                .CAN             = CAN2,
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_CANEN    = RCC_APB1ENR_CAN2EN,
                .APBRSTR_CANRSTR = RCC_APB1RSTR_CAN2RST,
                .TX_IRQn         = CAN2_TX_IRQn,
                .RX0_IRQn        = CAN2_RX0_IRQn,
                .RX1_IRQn        = CAN2_RX1_IRQn,
                .SCE_IRQn        = CAN2_SCE_IRQn,
                .FILTERS_COUNT   = 14,
        },
        #endif
        #if defined(RCC_APB1ENR_CAN3EN)
        {
                .CAN             = CAN3,
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_CANEN    = RCC_APB1ENR_CAN3EN,
                .APBRSTR_CANRSTR = RCC_APB1RSTR_CAN3RST,
                .TX_IRQn         = CAN3_TX_IRQn,
                .RX0_IRQn        = CAN3_RX0_IRQn,
                .RX1_IRQn        = CAN3_RX1_IRQn,
                .SCE_IRQn        = CAN3_SCE_IRQn,
                .FILTERS_COUNT   = 13,
        },
        #endif
};

/*==============================================================================
  Exported object
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device.
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_INIT(CAN, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        int err = EINVAL;

        if (major < _CAN_COUNT && minor == 0) {

                err = sys_zalloc(sizeof(CAN_t), device_handle);
                if (!err) {

                        CAN_t *hdl = *device_handle;

                        hdl->major        = major;
                        hdl->recv_timeout = MAX_DELAY_MS;
                        hdl->send_timeout = 0;

                        err = sys_mutex_create(MUTEX_TYPE_RECURSIVE, &hdl->config_mtx);
                        if (err) {
                                goto finish;
                        }

                        err = sys_queue_create(RX_MAILBOXES * RX_FIFO_DEPTH,
                                               sizeof(CAN_FIFOMailBox_TypeDef),
                                               &hdl->rxqueue_q);
                        if (err) {
                                goto finish;
                        }

                        for (int i = 0; i < TX_MAILBOXES; i++) {
                                err = sys_mutex_create(MUTEX_TYPE_NORMAL, &hdl->txmbox_mtx[i]);
                                if (err) {
                                        goto finish;
                                }

                                err = sys_queue_create(1, sizeof(int), &hdl->txrdy_q[i]);
                                if (err) {
                                        goto finish;
                                }
                        }

                        #if defined(RCC_APB1ENR_CAN2EN)
                        if (major == _CAN2) {
                                // CAN2 is slave of CAN1, this means that CAN1
                                // should be enabled to get filter access
                                SET_BIT(*CANX[_CAN1].APBENR, CANX[_CAN1].APBENR_CANEN);
                        }
                        #endif

                        SET_BIT(*CANX[hdl->major].APBENR, CANX[hdl->major].APBENR_CANEN);

                        #if defined(RCC_APB1ENR_CAN2EN)
                        if ((major == _CAN1) && (*CANX[_CAN2].APBENR & CANX[_CAN2].APBENR_CANEN)) {
                                // when CAN2 is already used then CAN1 cannot be reset

                        } else
                        #endif
                        {
                                SET_BIT(*CANX[hdl->major].APBRSTR, CANX[hdl->major].APBRSTR_CANRSTR);
                                CLEAR_BIT(*CANX[hdl->major].APBRSTR, CANX[hdl->major].APBRSTR_CANRSTR);
                        }

                        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_RESET);
                        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_RESET);

                        NVIC_ClearPendingIRQ(CANX[hdl->major].TX_IRQn);
                        NVIC_EnableIRQ(CANX[hdl->major].TX_IRQn);
                        NVIC_SetPriority(CANX[hdl->major].TX_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                        NVIC_ClearPendingIRQ(CANX[hdl->major].RX0_IRQn);
                        NVIC_EnableIRQ(CANX[hdl->major].RX0_IRQn);
                        NVIC_SetPriority(CANX[hdl->major].RX0_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                        NVIC_ClearPendingIRQ(CANX[hdl->major].RX1_IRQn);
                        NVIC_EnableIRQ(CANX[hdl->major].RX1_IRQn);
                        NVIC_SetPriority(CANX[hdl->major].RX1_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                        NVIC_ClearPendingIRQ(CANX[hdl->major].SCE_IRQn);
                        NVIC_EnableIRQ(CANX[hdl->major].SCE_IRQn);
                        NVIC_SetPriority(CANX[hdl->major].SCE_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                        err = set_init_mode(hdl);
                        if (err) {
                                goto finish;
                        }

                        if (config) {
                                err = configure(hdl, config);
                        }

                        finish:
                        if (!err) {
                                CAN_HDL[major] = hdl;

                        } else {
                                relese_resources(hdl);
                        }
                }
        }

