devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
        return err;
}

//==============================================================================
/**
 * @brief IO control.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_IOCTL(CAN, void *device_handle, int request, void *arg)
{
        CAN_t *hdl = device_handle;

        int err = EINVAL;

        switch (request) {
        case IOCTL_CAN__CONFIGURE:
                if (arg) {
                        err = configure(hdl, arg);
                }
                break;

        case IOCTL_CAN__SET_FILTER:
                if (arg) {
                        err = set_filter(hdl, arg);
                }
                break;

        case IOCTL_CAN__DISABLE_FILTER:
                if (arg) {
                        err = disable_filter(hdl, *cast(u32_t*, arg));
                }
                break;

        case IOCTL_CAN__GET_NUMBER_OF_FILTERS:
                if (arg) {
                        *cast(u32_t*, arg) = CANX[hdl->major].FILTERS_COUNT;
                        err = ESUCC;
                }
                break;

        case IOCTL_CAN__SET_MODE:
                if (arg) {
                        CAN_mode_t mode = *cast(CAN_mode_t*, arg);
                        switch (mode) {
                        case CAN_MODE__INIT  : err = set_init_mode(hdl); break;
                        case CAN_MODE__NORMAL: err = set_normal_mode(hdl); break;
                        case CAN_MODE__SLEEP : err = set_sleep_mode(hdl); break;
                        default              : err = EINVAL; break;
                        }
                }
                break;

        case IOCTL_CAN__SET_SEND_TIMEOUT:
                if (arg) {
                        hdl->send_timeout = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_CAN__SET_RECV_TIMEOUT:
                if (arg) {
                        hdl->recv_timeout = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_CAN__SEND_MSG:
                if (arg) {
                        err = send_msg(hdl, arg, hdl->send_timeout);
                }
                break;

        case IOCTL_CAN__RECV_MSG:
                if (arg) {
                        err = recv_msg(hdl, arg, hdl->recv_timeout);
                }
                break;

        default:
                err = EBADRQC;
                break;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_FLUSH(CAN, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_STAT(CAN, void *device_handle, struct vfs_dev_stat *device_stat)
{
        CAN_t *hdl = device_handle;

        size_t items = 0;
        sys_queue_get_number_of_items(hdl->rxqueue_q, &items);

        device_stat->st_size = items * sizeof(CAN_msg_t);

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Release resources allocated by module.
 *
 * @param  hdl          module instance
 */
//==============================================================================
static void relese_resources(CAN_t *hdl)
{
        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_RESET);
        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_RESET);

        #if defined(RCC_APB1ENR_CAN2EN)
        if ((hdl->major == _CAN1) && (*CANX[_CAN2].APBENR & CANX[_CAN2].APBENR_CANEN)) {
                // when CAN2 is already used then CAN1 cannot be reset

        } else
        #endif
        {
                SET_BIT(*CANX[hdl->major].APBRSTR, CANX[hdl->major].APBRSTR_CANRSTR);
                CLEAR_BIT(*CANX[hdl->major].APBRSTR, CANX[hdl->major].APBRSTR_CANRSTR);
                CLEAR_BIT(*CANX[hdl->major].APBENR, CANX[hdl->major].APBENR_CANEN);

                #if defined(RCC_APB1ENR_CAN2EN)
                if ((hdl->major == _CAN2) && (CAN_HDL[_CAN1] == NULL)) {
                        CLEAR_BIT(*CANX[_CAN1].APBENR, CANX[_CAN1].APBENR_CANEN);
                }
                #endif
        }

        if (hdl->config_mtx) {
                sys_mutex_destroy(hdl->config_mtx);
        }

        if (hdl->rxqueue_q) {
                sys_queue_destroy(hdl->rxqueue_q);
        }

        for (int i = 0; i < TX_MAILBOXES; i++) {
                if (hdl->txmbox_mtx[i]) {
                        sys_mutex_destroy(hdl->txmbox_mtx[i]);
                }

                if (hdl->txrdy_q[i]) {
                        sys_queue_destroy(hdl->txrdy_q[i]);
                }
        }

        sys_free((void*)&hdl);
}

//==============================================================================
/**
 * @brief  Configure peripheral.
 *
 * @param  hdl          module instance
 * @param  cfg          configuration
 *
 * @return One of errno value.
 */
//==============================================================================
static int configure(CAN_t *hdl, const CAN_config_t *cfg)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                SET_BIT(CANX[hdl->major].CAN->MCR, (CAN_MCR_DBF * _CAN_CFG__DEBUG_FREEZE)
                                 | CAN_MCR_TXFP
                                 | CAN_MCR_RFLM);

                SET_BIT(CANX[hdl->major].CAN->IER, CAN_IER_FMPIE1
                                 | CAN_IER_FMPIE0
                                 | CAN_IER_TMEIE);

                if (cfg->auto_bus_off_management) {
                        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_ABOM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_ABOM);
                }

                if (cfg->auto_retransmission) {
                        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_NART);
                } else {
                        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_NART);
                }

                if (cfg->auto_wake_up) {
                        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_AWUM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_AWUM);
                }

                if (cfg->time_triggered_comm) {
                        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_TTCM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_TTCM);
                }

                if (cfg->loopback) {
                        SET_BIT(CANX[hdl->major].CAN->BTR, CAN_BTR_LBKM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->BTR, CAN_BTR_LBKM);
                }

                if (cfg->silent) {
                        SET_BIT(CANX[hdl->major].CAN->BTR, CAN_BTR_SILM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->BTR, CAN_BTR_SILM);
                }

                u32_t SJW = cfg->SJW;
                u32_t TS1 = cfg->TS1;
                u32_t TS2 = cfg->TS2;
                u32_t BRP = cfg->prescaler;

                if ((SJW < 1) || (SJW > 4)) {
                        SJW = min(4, SJW);
                        SJW = max(1, SJW);
                        printk("%s: SJW out of rage! Changed to %d", GET_MODULE_NAME(), SJW);
                }

                if ((TS1 < 1) || (TS1 > 15)) {
                        TS1 = min(15, TS1);
                        TS1 = max(1, TS1);
                        printk("%s: TS1 out of rage! Changed to %d", GET_MODULE_NAME(), TS1);
                }

                if ((TS2 < 1) || (TS2 > 7)) {
                        TS2 = min(7, TS2);
                        TS2 = max(1, TS2);
                        printk("%s: TS2 out of rage! Changed to %d", GET_MODULE_NAME(), TS2);
                }

                if ((BRP < 1) || (BRP > 1024)) {
                        BRP = min(1024, BRP);
                        BRP = max(1, BRP);
                        printk("%s: BRP out of rage! Changed to %d", GET_MODULE_NAME(), BRP);
                }

