devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
                CANX[hdl->major].CAN->BTR = (CAN_BTR_LBKM * cfg->loopback)
                                          | (CAN_BTR_SILM * cfg->silent)
                                          | ((SJW - 1) << 24)
                                          | ((TS2 - 1) << 20)
                                          | ((TS1 - 1) << 16)
                                          | ((BRP - 1) <<  0);

                LL_RCC_ClocksTypeDef freq;
                LL_RCC_GetSystemClocksFreq(&freq);
                u32_t PCLK = freq.PCLK1_Frequency;

                u32_t baud = PCLK / (cfg->prescaler * (1 + TS1 + TS2));
                printk("%s: baud rate: %u bps", GET_MODULE_NAME(), baud);

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set CAN controller to initialization mode.
 *
 * @param  hdl          module instance
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_init_mode(CAN_t *hdl)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                err = EIO;

                u32_t tref = sys_get_uptime_ms();

                CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_SLEEP);
                SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_INRQ);

                while (not sys_time_is_expired(tref, INIT_TIMEOUT)) {
                        if (CANX[hdl->major].CAN->MSR & CAN_MSR_INAK) {
                                err = ESUCC;
                                break;
                        }
                }

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set CAN controller to normal mode (active).
 *
 * @param  hdl          module instance
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_normal_mode(CAN_t *hdl)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                err = EIO;

                u32_t tref = sys_get_uptime_ms();

                CLEAR_BIT(CANX[hdl->major].CAN->FMR, CAN_FMR_FINIT);
                CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_INRQ | CAN_MCR_SLEEP);

                while (not sys_time_is_expired(tref, INIT_TIMEOUT)) {
                        if (!(CANX[hdl->major].CAN->MSR & CAN_MSR_INAK)) {
                                err = ESUCC;
                                break;
                        }
                }

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set CAN controller to sleep mode.
 *
 * @param  hdl          module instance
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_sleep_mode(CAN_t *hdl)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_SLEEP);
                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set acceptance filter.
 *
 * @param  hdl          module instance
 * @param  filter       filter configuration
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_filter(CAN_t *hdl, const CAN_filter_t *filter)
{
        if (filter->number >= CANX[hdl->major].FILTERS_COUNT) {
                return EINVAL;
        }

        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                u8_t major = hdl->major;
                u8_t filter_no = filter->number;

                #if defined(RCC_APB1ENR_CAN2EN)
                // CAN2 is slave of CAN1
                // CAN1 and CAN2 have common registers
                if (hdl->major == _CAN2) {
                        filter_no += CANX[_CAN1].FILTERS_COUNT;
                        major = _CAN1;
                }
                #endif

                // CAN2 filter offset + filter initialization bit
                CANX[major].CAN->FMR = (CANX[_CAN1].FILTERS_COUNT << 8) | CAN_FMR_FINIT;

                // mask mode
                CLEAR_BIT(CANX[major].CAN->FM1R, CAN_FM1R_FBM0 << filter_no);

                // 32b ID
                SET_BIT(CANX[major].CAN->FS1R, CAN_FS1R_FSC0 << filter_no);

                // FIFO0: odd filters, FIFO1: even filters)
                WRITE_REG(CANX[major].CAN->FFA1R, 0xAAAAAAAA);

                // set ID and mask
                if (filter->extended_ID) {
                        CANX[major].CAN->sFilterRegister[filter_no].FR1 = (filter->ID << 3) | CAN_TI0R_IDE;
                        CANX[major].CAN->sFilterRegister[filter_no].FR2 = (filter->mask << 3) | CAN_TI0R_IDE;

                } else {
                        CANX[major].CAN->sFilterRegister[filter_no].FR1 = (filter->ID << 21);
                        CANX[major].CAN->sFilterRegister[filter_no].FR2 = (filter->mask << 21);
                }

                SET_BIT(CANX[major].CAN->FA1R, CAN_FA1R_FACT0 << filter_no);

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function disable selected filter number. To disable filter INIT mode
 *         must be activated.
 *
 * @param  hdl                  module instance
 * @param  filter_no            filter number
 *
 * @return One of errno value.
 */
//==============================================================================
static int disable_filter(CAN_t *hdl, u32_t filter_no)
{
        int err = EINVAL;

