devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
        if (filter_no < CANX[hdl->major].FILTERS_COUNT) {

                err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
                if (!err) {
                        u8_t major = hdl->major;

                        #if defined(RCC_APB1ENR_CAN2EN)
                        // CAN2 is slave of CAN1
                        // CAN1 and CAN2 have common registers
                        if (hdl->major == _CAN2) {
                                filter_no += CANX[_CAN1].FILTERS_COUNT;
                                major = _CAN1;
                        }
                        #endif

                        // CAN2 filter offset + filter initialization bit
                        CANX[major].CAN->FMR = (CANX[_CAN1].FILTERS_COUNT << 8) | CAN_FMR_FINIT;

                        CLEAR_BIT(CANX[major].CAN->FA1R, CAN_FA1R_FACT0 << filter_no);

                        sys_mutex_unlock(hdl->config_mtx);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function send CAN message.
 *
 * @param  hdl          module instance
 * @param  msg          message to send
 * @param  timeout_ms   timeout in milliseconds
 *
 * @return One of errno value.
 */
//==============================================================================
static int send_msg(CAN_t *hdl, const CAN_msg_t *msg, u32_t timeout_ms)
{
        sys_context_switch_lock();
        hdl->txpend_ctr++;
        sys_context_switch_unlock();

        int   err     = ETIME;
        bool  loop    = true;
        u32_t timeout = max(1, timeout_ms);

        u32_t tref = sys_get_uptime_ms();

        while (loop && !sys_time_is_expired(tref, timeout)) {

                err = ETIME;

                for (int i = 0; loop && (i < TX_MAILBOXES); i++) {

                        err = sys_mutex_trylock(hdl->txmbox_mtx[i]);
                        if (!err) {
                                CAN_TxMailBox_TypeDef *mbox = &CANX[hdl->major].CAN->sTxMailBox[i];

                                if (!(mbox->TIR & CAN_TI0R_TXRQ)) {
                                        mbox->TIR = CAN_TI0R_RTR * msg->remote_transmission;

                                        if (msg->extended_ID) {
                                                mbox->TIR |= (msg->ID << 3);
                                                mbox->TIR |= CAN_TI0R_IDE;
                                        } else {
                                                mbox->TIR |= (msg->ID << 21);
                                        }

                                        mbox->TDTR = min(8, msg->data_length) & CAN_TDT0R_DLC;

                                        mbox->TDLR = msg->data[0] << 0
                                                   | msg->data[1] << 8
                                                   | msg->data[2] << 16
                                                   | msg->data[3] << 24;

                                        mbox->TDHR = msg->data[4] << 0
                                                   | msg->data[5] << 8
                                                   | msg->data[6] << 16
                                                   | msg->data[7] << 24;

                                        sys_queue_reset(hdl->txrdy_q[i]);

                                        SET_BIT(mbox->TIR, CAN_TI0R_TXRQ);

                                        int erri = EIO;
                                        err = sys_queue_receive(hdl->txrdy_q[i], &erri, timeout);
                                        if (!err) {
                                                err = erri;

                                        } else {
                                                printk("CAN: message send abort");
                                                SET_BIT(CANX[hdl->major].CAN->TSR, CAN_TSR_ABRQ0 << (i * 8));
                                                sys_sleep_ms(1);
                                        }

                                        loop = false;
                                } else {
                                        err = EBUSY;
                                }

                                sys_mutex_unlock(hdl->txmbox_mtx[i]);
                        }
                }

                if (loop) {
                        sys_sleep_ms(1);
                }
        }

        sys_context_switch_lock();
        hdl->txpend_ctr--;
        sys_context_switch_unlock();

        return err;
}

//==============================================================================
/**
 * @brief  Receive message.
 *
 * @param  hdl          module instance
 * @param  msg          message container to receive to
 *
 * @return One of errno value.
 */
//==============================================================================
static int recv_msg(CAN_t *hdl, CAN_msg_t *msg, u32_t timeout_ms)
{
        sys_context_switch_lock();
        hdl->rxpend_ctr++;
        sys_context_switch_unlock();

        CAN_FIFOMailBox_TypeDef mbox;

        int err = sys_queue_receive(hdl->rxqueue_q, &mbox, timeout_ms);
        if (!err) {
                if (mbox.RIR & CAN_RI0R_IDE) {
                        msg->ID = mbox.RIR >> 3;
                        msg->extended_ID = true;
                } else {
                        msg->ID = mbox.RIR >> 21;
                        msg->extended_ID = false;
                }

                msg->remote_transmission = mbox.RIR & CAN_RI0R_RTR;
                msg->data_length         = mbox.RDTR & CAN_RDT0R_DLC;
                msg->data[0]             = mbox.RDLR >> 0;
                msg->data[1]             = mbox.RDLR >> 8;
                msg->data[2]             = mbox.RDLR >> 16;
                msg->data[3]             = mbox.RDLR >> 24;
                msg->data[4]             = mbox.RDHR >> 0;
                msg->data[5]             = mbox.RDHR >> 8;
                msg->data[6]             = mbox.RDHR >> 16;
                msg->data[7]             = mbox.RDHR >> 24;
        }

        sys_context_switch_lock();
        hdl->rxpend_ctr--;
        sys_context_switch_unlock();

