devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
        return err;
}

//==============================================================================
/**
 * @brief  CAN Tx handle function.
 *
 * @param  hdl          driver handle
 *
 * @return True if yield needed.
 */
//==============================================================================
static bool CAN_TX_IRQ(CAN_t *hdl)
{
        bool yield = false;

        static const u32_t CAN_TSR_RQCP[TX_MAILBOXES] = {CAN_TSR_RQCP0,
                                                         CAN_TSR_RQCP1,
                                                         CAN_TSR_RQCP2};

        static const u32_t CAN_TSR_TERR[TX_MAILBOXES] = {CAN_TSR_TERR0,
                                                         CAN_TSR_TERR1,
                                                         CAN_TSR_TERR2};

        static const u32_t CAN_TSR_ALST[TX_MAILBOXES] = {CAN_TSR_ALST0,
                                                         CAN_TSR_ALST1,
                                                         CAN_TSR_ALST2};

        static const u32_t CAN_TSR_TXOK[TX_MAILBOXES] = {CAN_TSR_TXOK0,
                                                         CAN_TSR_TXOK1,
                                                         CAN_TSR_TXOK2};

        for (int i = 0; i < TX_MAILBOXES; i++) {

                if (CANX[hdl->major].CAN->TSR & CAN_TSR_RQCP[i]) {

                        int err = EIO;

                        if (CANX[hdl->major].CAN->TSR & CAN_TSR_TERR[i]) {
                                err = EIO;
                        } else if (CANX[hdl->major].CAN->TSR & CAN_TSR_ALST[i]) {
                                err = EAGAIN;
                        } else if (CANX[hdl->major].CAN->TSR & CAN_TSR_TXOK[i]) {
                                err = ESUCC;
                        }

                        SET_BIT(CANX[hdl->major].CAN->TSR, CAN_TSR_RQCP[i]);

                        bool woken = false;
                        sys_queue_send_from_ISR(hdl->txrdy_q[i], &err, &woken);

                        yield |= woken;
                }
        }

        return yield;
}

//==============================================================================
/**
 * @brief  Function receive FIFO message.
 *
 * @param  hdl          driver handle
 * @param  fifo         fifo number
 *
 * @return True if yield needed.
 */
//==============================================================================
static bool CAN_RX_IRQ(CAN_t *hdl, u8_t fifo)
{
        bool yield = false;

        sys_queue_send_from_ISR(hdl->rxqueue_q, &CANX[hdl->major].CAN->sFIFOMailBox[fifo], &yield);

        SET_BIT(CANX[hdl->major].CAN->RF0R, CAN_RF0R_RFOM0);

        return yield;
}

//==============================================================================
/**
 * @brief CAN1 TX ready IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN1EN)
void CAN1_TX_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN1];
        if (hdl) {
                bool yield = CAN_TX_IRQ(hdl);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN1 FIFO0 Rx IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN1EN)
void CAN1_RX0_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN1];
        if (hdl) {
                bool yield = CAN_RX_IRQ(hdl, 0);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN1 FIFO1 Rx IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN1EN)
void CAN1_RX1_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN1];
        if (hdl) {
                bool yield = CAN_RX_IRQ(hdl, 1);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN1 status change IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN1EN)
void CAN1_SCE_IRQHANDLER(void)
{

}
#endif

//==============================================================================
/**
 * @brief CAN2 TX ready IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN2EN)
void CAN2_TX_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN2];
        if (hdl) {
                bool yield = CAN_TX_IRQ(hdl);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN2 FIFO0 Rx IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN2EN)
void CAN2_RX0_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN2];
        if (hdl) {
                bool yield = CAN_RX_IRQ(hdl, 0);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN2 FIFO1 Rx IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN2EN)
void CAN2_RX1_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN2];
        if (hdl) {
                bool yield = CAN_RX_IRQ(hdl, 1);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN2 status change IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN2EN)
void CAN2_SCE_IRQHANDLER(void)
{

}
#endif

//==============================================================================
/**
 * @brief CAN3 FIFO0 Rx IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN3EN)
void CAN3_RX0_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN3];
        if (hdl) {
                bool yield = CAN_RX_IRQ(hdl, 0);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN3 TX ready IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN3EN)
void CAN3_TX_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN3];
        if (hdl) {
                bool yield = CAN_TX_IRQ(hdl);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN3 FIFO1 Rx IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN3EN)
void CAN3_RX1_IRQHANDLER(void)
{
        CAN_t *hdl = CAN_HDL[_CAN3];
        if (hdl) {
                bool yield = CAN_RX_IRQ(hdl, 1);
                sys_thread_yield_from_ISR(yield);
        }
}
#endif

//==============================================================================
/**
 * @brief CAN3 status change IRQ.
 */
//==============================================================================
#if defined(RCC_APB1ENR_CAN3EN)
void CAN3_SCE_IRQHANDLER(void)
{

}
#endif

/*==============================================================================
  End of file
==============================================================================*/
